{
  "backend": "tensorflow",
  "config": [
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "batch_input_shape": [
          null,
          1,
          1,
          2048
        ],
        "dtype": "float32",
        "name": "flatten_3"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activation": "relu",
        "activity_regularizer": null,
        "bias_regularizer": null,
        "use_bias": true,
        "kernel_constraint": null,
        "units": 1024,
        "trainable": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "seed": null,
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform"
          }
        },
        "bias_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "seed": null,
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform"
          }
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "name": "dense_4"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "trainable": true,
        "rate": 0.5,
        "name": "dropout_3"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activation": "softmax",
        "activity_regularizer": null,
        "bias_regularizer": null,
        "use_bias": true,
        "kernel_constraint": null,
        "units": 133,
        "trainable": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "seed": null,
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform"
          }
        },
        "bias_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "seed": null,
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform"
          }
        },
        "bias_constraint": null,
        "kernel_regularizer": null,
        "name": "dense_5"
      }
    }
  ],
  "class_name": "Sequential",
  "keras_version": "2.0.0"
}